 #Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторМобильный) Тогда
		ИдентификаторМобильный = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаФиксации) Тогда
		ДатаФиксации = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторМобильный) Тогда
		ИдентификаторМобильный = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаФиксации) Тогда
		ДатаФиксации = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Автоформирование наименования для списка на главном экране (макет 05.2)
	Если ЗначениеЗаполнено(Партнер) Тогда
		Наименование = СокрЛП(Строка(Партнер));
	ИначеЕсли ЗначениеЗаполнено(НаименованиеОрганизации) Тогда
		Наименование = СокрЛП(НаименованиеОрганизации);
	ИначеЕсли ЗначениеЗаполнено(ФИОКонтакта) Тогда
		Наименование = СокрЛП(ФИОКонтакта);
	Иначе
		Наименование = "без визитки";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти