                              
&НаСервере
Процедура ПодготовитьКартинкуНаСервере()

    АдресКартинки = "";

    Если Вложение = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Если Вложение.Пустая() Тогда
        Возврат;
    КонецЕсли;

    ОбъектВложения = Вложение.ПолучитьОбъект();

    Если ОбъектВложения = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Если ОбъектВложения.Данные = Неопределено Тогда
        Возврат;
    КонецЕсли;

    ДвоичныеДанные = ОбъектВложения.Данные.Получить();

    Если ДвоичныеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;

    АдресКартинки = ПоместитьВоВременноеХранилище(
        ДвоичныеДанные,
        УникальныйИдентификатор);

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)

    ПодготовитьКартинкуНаСервере();

КонецПроцедуры
